[ 
    {
        "title": "Passing Data Between Screens in Jetpack Compose: A Comprehensive Guide",
        "description": "In Jetpack Compose, when building multi-screen applications, it’s essential to pass data between screens efficiently and in a way that suits the complexity and requirements of your app.",
        "image": "https://miro.medium.com/v2/resize:fit:1400/format:webp/0*EzfzkCT9O2EJ7dmx.png",
        "link": "https://medium.com/@muhamed.riyas/passing-data-between-screens-in-jetpack-compose-a-comprehensive-guide-76f9af967843"
    },
    {
        "title": "The Lifecycle of Jetpack Compose Composables vs. Android View Lifecycle: A Quick Dive",
        "description": "In Android development, understanding the lifecycle of UI components is crucial to creating responsive and efficient applications. Traditionally, Android UIs have been built using Views and the ViewGroup hierarchy. However, with the introduction of Jetpack Compose, a new paradigm for building UIs has emerged.",
        "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/0*bwBDPKj8bNLJOmhI.png",
        "link": "https://medium.com/@muhamed.riyas/the-lifecycle-of-jetpack-compose-composables-vs-android-view-lifecycle-a-quick-dive-61f93f70cd71"
    },
    {
        "title": "Jetpack Compose AppBars: From Basics to Advanced Scroll Behaviors",
        "description": "Jetpack Compose offers a flexible and powerful way to build UI in Android. One of the essential components in any Android app is the AppBar, which provides a consistent space for branding, screen titles, and actions. In this post, we’ll explore different types of AppBar components in Jetpack Compose.",
        "image": "https://miro.medium.com/v2/resize:fit:640/format:webp/0*FdTv8TUZGnlDcR9q.png",
        "link": "https://medium.com/@muhamed.riyas/jetpack-compose-appbars-from-basics-to-advanced-scroll-behaviors-44a3a6cc62f0"
    },
    {
        "title": "Flutter Firebase Initialization with DefaultFirebaseOptions : An Easy Guide",
        "description": "In this blog post, I’ll guide you through the process of setting up Firebase in your Flutter application. I’ll cover the initialization of Firebase with the await Firbase.initializeApp() method and the generation of DefaultFirebaseOptions using the Firebase CLI.",
        "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*dDY00RZJhRPoVZ77NcFFrA.png",
        "link": "https://medium.com/@muhamed.riyas/setting-up-firebase-initialization-in-flutter-80f1a9d3183d"
    },
    {
        "title": "Enhancing Accessibility in Android Compose with CollectionInfo",
        "description": "Accessibility is a crucial aspect of app development, ensuring that your app is usable by everyone, including individuals with disabilities. In Android Compose, you can make your user interface (UI) elements accessible using various tools and techniques.",
        "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/0*H9e7b0U0CerQ7RNG.png",
        "link": "https://medium.com/@muhamed.riyas/enhancing-accessibility-in-android-compose-with-collectioninfo-31439e0e057e"
    },
    {
        "title": "Navigation Component- The Complete Guide",
        "description": "Android Jetpack is a set of components, tools, libraries and guidance to help developers to create a brilliant quality-oriented application. In this blog we are going to discuss the latest addition to the Jetpack, the “Navigation Component”. Assuming that you have basic knowledge in android and you are eager to master in android.",
        "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*-zvE1oOJwo-LX6Elyrgazg.png",
        "link": "https://medium.com/@muhamed.riyas/navigation-component-the-complete-guide-c51c9911684"
    },
    {
        "title": "Android Bluetooth Architecture",
        "description": "Bluetooth is a wireless technology standard for exchanging data between fixed and mobile devices over short distances using short-wavelength from 2.400 to 2.485 GHz.",
        "image": "https://miro.medium.com/v2/resize:fit:640/format:webp/1*aZSj4e1HFyx5s9QvHTJRXA.png",
        "link": "https://medium.com/@muhamed.riyas/android-bluetooth-architecture-853645eff17f"
    },
    {
        "title": "BLE- An overview",
        "description": "BLE stands for Bluetooth Low Energy (Bluetooth LE, and marketed as Bluetooth Smart). Bluetooth Low Energy (BLE), sometimes referred to as “Bluetooth Smart”, is a light-weight subset of classic Bluetooth and was introduced as part of the Bluetooth 4.0 core specification",
        "image": "https://miro.medium.com/v2/resize:fit:1400/format:webp/1*pXVNrUH8bu136mPKYwxX0A.png",
        "link": "https://medium.com/@muhamed.riyas/ble-an-overview-d524ceb73c94"
    }
]
