[
  {
    "id": 1,
    "title": "MyDyson™",
    "short_desc": "As a mobile app developer, I contributed to the development and enhancement of the MyDyson™ app, a comprehensive tool designed to elevate the user experience for Dyson machine owners.",
    "description": "As a mobile app developer, I contributed to the development and enhancement of the MyDyson™ app, a comprehensive tool designed to elevate the user experience for Dyson machine owners. This project involved re-engineering the app to include tailored content and features for hair care machines and cordless vacuums, along with providing real-time air quality information and remote control capabilities for Dyson purifiers and humidifiers. My role focused on writing scalable, clean, and stable code, collaborating with cross-functional teams, and designing elegant UI components using Compose UI. Additionally, I worked on core connectivity features, enabling seamless management of multiple devices and facilitating user engagement through community integration.",
    "image": "https://play-lh.googleusercontent.com/L6sS1R-ea5F2HLIB8WlqvPuGG1Z8M9g-M5Ss36pDZdVQAXcoh6ODtqSURBzjbECGWdg",
    "images": [
      "https://play-lh.googleusercontent.com/CHt4OWe8UvO0Qau4j9Tq5ztaX2-soZBs4oD6OQY8Q_RBQOFM516NYtLbqE6rO7RtwA=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/r4Q9zi9RhFY233FBDpZjAE6yUN_b8iMJ7kpdjR3dBN9srcWD6R1oMPBCNnl7pSn-KuOv=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/pdLAQq0sGWDJJom5VEk1yWcbPgWbz4MCUWkkONDCWjEimscnGRMOOJDAPH1Ztt429z8=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/UAEzyITJoLjwH0Z6EIoBb2l5LhHURY8zvBuVnUzrU9QyxheUxHuHHYMw8uDeylIHQg=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/Xyu4avVz_VoGsD4gGxV4NQH4EHObnsxdA-pNiDpq3PmyOzFBaB2t4AG4P0hJBWE6RCA=w1052-h592-rw"
    ],
    "highlighs": [
      "Implemented new features in MyDyson app using Kotlin, Jetpack compose, Android Navigation Component based on modern Android development tools and principles like MVVM, Kotlin-coroutine, Flow, RxJava, Dagger/Hilt/Koin, Retrofit and Room",
      "Enhanced user satisfaction to 95% by fixing connectivity issues in Dyson connected products by optimizing Bluetooth Low Energy (BLE) connections and introducing a backoff retransmission mechanism.",
      "Innovated paparazzi snapshot wrapper for comprehensive testing of Jetpack Compose UI elements covering all UI/UX states saving substantial development time, ensuring no missed test cases, and achieving 100% test coverage",
      "Introduced an engineering UI to troubleshoot Dyson-connected product issues faced by the QA/stakeholders, enabling cross-team developers to quickly identify and assign bugs to the relevant teams",
      "Reduced Java source base to 2% in a multi-module project by re-writing Java code to Kotlin during my innovative time.",
      "Authored reusable, self-documenting, high-performing code and participated in code reviews and pair programming to ensure 100% code quality and maintainability",
      "Assisted QA to setup, build and test frameworks such as Junit, Espresso, and Paparazzi",
      "Collaborated with cross-functional teams (UI/UX team, Embedded, Cloud, and QA) across multiple geographies to define, design, and ship new features",
      "Experienced in Agile environment and presented sprint demos and technical sessions to stakeholders in community meetings."
    ],
    "tags": [
      "Kotlin",
      "Android",
      "Compose",
      "MVVM",
      "Clean Code",
      "Dagger2",
      "Analytics",
      "CI/CD",
      "BLE",
      "MQTT",
      "Multi-module"
    ],
    "link": "https://play.google.com/store/apps/details?id=com.dyson.mobile.android&hl=en_GB"
  },
  {
    "id": 2,
    "title": "Lumos Controls",
    "short_desc": "As an initial team member of the Lumos Control startup project, I played a pivotal role in its development and evolution. The project began with Java and later transitioned to Kotlin",
    "description": "As an initial team member of the Lumos Control startup project, I played a pivotal role in its development and evolution. The project began with Java and later transitioned to Kotlin, employing MVP and MVVM architectures. I was instrumental in building and leading the team, conducting interviews, providing mentorship, and driving technical innovation. Key contributions included integrating advanced tech features such as BLE, MQTT, WiFi, TCP/IP protocols, and HTTP/REST API calls. I also developed a standalone smart home IoT SDK, enabling the company to rebrand the app for multiple clients, including Samsung, Jio, and Philips.",
    "image": "https://i.ytimg.com/vi/hxt6UeHBp3U/hqdefault.jpg",
    "tags": [
      "Kotlin",
      "Android",
      "Java",
      "IoT",
      "Xml",
      "Room",
      "BLE",
      "MQTT",
      "Retrofit",
      "Hilt",
      "MVVM"
    ],
    "images": [
      "https://play-lh.googleusercontent.com/hLHwBCBJ15PyeCZlZETiVgN8mno6lhtBdl_uOd5pcNzA_AWTvEn3hNcsRYrrnMCg=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/osGBZMqHJTvfMN8LfADboJNpdqhWEaGaEkZIFhjbheRWQo93xGZgxuHYhYhmbNcbrg=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/oaQoyEOQ3d1Bo2FxLwKOmzRh1pnYrAyAcL1yBP4-9p8m5Mg8J4PLvef86zQlMtv7SdU=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/o2XaWTON-87H-XlYc015jAYL4eZjLlNjZnqCl2mWr3kMHCZ4-1EbehvCNsg7PhqdSrc=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/gCHCcwysg8_5ybjCNjGzUO5gmzgusc6zQYvam15Pyezqy0ckNN3SksdDA3YqPV_fTg=w1052-h592-rw"
    ],
    "highlighs": [
      "As a proven leader and application architect, I drive system architecture decisions and lead projects from concept through to launch",
      "Prototyped, designed, developed, tested and published mobile apps for Home automation, Real-time tracking and Broadcasting and media solutions",
      "Delivered quarantine management apps within stringent timelines (under 45 days) to Ministry of Health of various countries (Singapore, Brunei, Cayman Island) during the COVID pandemic resulting in 50% revenue increase",
      "Developed WiSilica Mesh Android SDK with documentation, empowering smart home/indoor tracking vendors to develop their own custom apps which contributed to acquiring notable clients like Samsung, Philips, iGuzzini and Jio",
      "Managed Android OS API updates successfully in run-time permissions, notification, background service restriction and location access, ensuring smooth operation of a user-sensitive quarantine management system",
      "Built offline-first app for optimum server API usage, reducing server traffic by 30%",
      "Resolved Bluetooth Low Energy (BLE) issues in IoT based applications, ensuring continued support on 100% Android versions and phones by: <br><td>-- Developing a BLE scanner wrapper to resolve inherent BLE scan limitations from Android 8.0 <br><td>-- Using BLE central mode of communication for phones which do not support BLE peripheral mode",
      "Migrated muti-module project from Java to Kotlin and MVVM architecture which reduced crashes to below 5% and resolved issues in application state management",
      "Developed Android Studio plugin to switch between application variant which reduced the build time by 40%",
      "Innovated an encryption library using AES-128 for secure communication, protecting against various security threats such as man-in-the-middle attack, attribute spoofing and eavesdropping",
      "Integrated Google Play services, Firebase analytics and Google Map API to boost user tracking by 30%",
      "Developed an internal sniffer app to decode the BLE messages from the embedded devices aiding cross-functional team and customers to analyze nearby BLE traffic and detect message loss resulting in BLE communication failure",
      "Hired and mentored junior developers, facilitating rapid project onboarding and skill development while transparently communicating to management about their progress and team building activities",
      "Promoted development best practices, patterns and standards"
    ],
    "link": "https://play.google.com/store/apps/details?id=com.wisilica.Home&hl=en_GB"
  },
  {
    "id": 3,
    "title": "Muslim Prime",
    "short_desc": "Muslim Prime is the ultimate mobile application designed to cater to the spiritual and daily needs of Muslims worldwide. This all-in-one app offers a suite of features tailored to support Muslims in their religious practices, making it an indispensable tool for enhancing your daily spiritual journey.",
    "description": "Muslim Prime is a cutting-edge mobile application crafted to address the spiritual and practical needs of Muslims worldwide. Developed with Flutter, the app provides essential features such as prayer times, Quranic readings, and daily Islamic reminders. The project leverages Firebase Cloud Firestore and Realtime Database for backend operations, and includes an admin panel built with Flutter Web for streamlined content management.",
    "image": "https://play-lh.googleusercontent.com/444SlG1iSxy85MvZvJqr4Rjrk7MzWTStNS0kXaNtyuwDUSO3o_ZSggcCWS4krZWMEd8=w480-h960-rw",
    "images": [
      "https://play-lh.googleusercontent.com/5uDrf65AScJId635wwiaM4ML97cE_3_izDojErfKWnnvu1062hx9uuVo_2ZMTUjys5g=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/-NxTX2DVsyXqwht9BWWQXsjvm_-LaYonPbdEICgh5YlGURd6jUqUDmeLg0rrwlk7A6Y=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/cov99uDxV64cQ7fO2sNv2hhhxZkt53mOUJQTAXETLP64x7OF3WB-Syko0GvPADrmJQ=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/iyBrSDunFS8udCMeJa7RUrrBG5fRUb_eVmI67PxTUyZsKDWV3VzvxmiicYktO3pRScVA=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/MXBsvBL1GyBJnkFJosPkqHD8ibtO2hnLe-sZXuMclgry5lZIhUwneG5U1gGIQHymoNZS=w1052-h592-rw"
    ],
    "tags": [
      "Flutter",
      "Dart",
      "BLoC",
      "Firebase",
      "Firebase Authentication",
      "Firbase Realtiem Database",
      "FCM",
      "Flutter Web",
      "Code Review"
    ],
    "link": "https://play.google.com/store/apps/details?id=com.dyson.mobile.android&hl=en_GB",
    "link_ios": "https://apps.apple.com/us/app/muslim-prime/id6479201511",
    "highlighs": [
      "<b>Leadership and Architecture:</b> Spearheaded the development of Muslim Prime, designing the app’s architecture with the BLoC pattern to ensure a clean, scalable, and maintainable codebase.",
      "<b>Coding and Development:</b> Actively engaged in hands-on coding, implementing core features, and ensuring high-quality code. Developed key functionalities such as prayer time calculations and real-time notifications.",
      "<b>Pair Programming:</b> Collaborated closely with a co-developer through pair programming sessions to efficiently tackle complex development tasks, enhance code quality, and foster collaborative problem-solving.",
      "<b>Code Review and Quality Assurance:</b> Performed comprehensive code reviews to enforce coding standards, identify and resolve issues, and optimize performance. Provided constructive feedback and mentorship to the co-developer, improving overall code quality and maintainability.",
      "<b>Backend Integration:</b> Integrated Firebase Cloud Firestore and Realtime Database for backend operations, enabling real-time data updates and seamless synchronization across the app.",
      "<b>Admin Panel Development:</b> Designed and developed an admin panel using Flutter Web, facilitating effective content management and user interaction for app administrators.",
      "<b>Deployment and ASO:</b> Managed the deployment of the app to Google Play Store and Apple App Store, implementing App Store Optimization (ASO) techniques that drove 50K downloads within three months without major advertising campaigns.",
      "<b>Documentation and Best Practices:</b> Created detailed documentation for codebase and development processes, establishing best practices for future development and easing onboarding for new team members.",
      "<b>Testing and Debugging:</b> Led the testing and debugging phases, ensuring the app's functionality across various devices and operating systems. Implemented automated testing strategies to enhance reliability and user experience."
    ]
  },
  {
    "id": 4,
    "title": "GMDC (Galadari Motor Driving Centre)",
    "short_desc": "GMDC (Galadari Motor Driving Centre) is a comprehensive mobile application designed to streamline the driving license acquisition process for Dubai residents. Developed using Flutter, this interactive app caters to both prospective drivers and current GMDC students.",
    "description": "GMDC (Galadari Motor Driving Centre) is a comprehensive mobile application designed to streamline the driving license acquisition process for Dubai residents. Developed using Flutter, this interactive app caters to both prospective drivers and current GMDC students. It provides a range of features to simplify the journey from course registration to license attainment, including online payments, scheduling, e-learning, and progress tracking. <br><br>The app enhances user experience by offering a centralized platform for managing all aspects of driving school interactions, making it easier for users to navigate their driving education and training.",
    "image": "https://play-lh.googleusercontent.com/eVjaF10UDsLwtPLu3uFibcGfhyf0W9lqDdg7opuE1NE5ls-zJjeyhLPaG_MyWWC09LN6=w480-h960-rw",
    "images": [
      "https://play-lh.googleusercontent.com/vzd8q9eyElKdxZMd4W3JWNsUsq_zYXAFjyrq8xFGJ85UOSSOHZVtgY-88wDFiNwY2Bs=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/7YYn9RcvBO15U5aQqCVwxqNOx0fG3PUwKcldYqxxhcwE7ZKbOAI8-qM_XoQlR0rleWI=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/JpLCEiukHlr4XOLDri7gNWq-i_qRMUnnerCT-LAR3xjXa5k3dU05z0jAIZuzzJSoSuA=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/M7jlio9AVTsTHZISVfgFE6Id3rhlYSBim9qD1o_3soIVzyq0RaWonv_bpWiBC-cse58=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/X9SUf-Cxk0lsrNNegQ6F3PROZsqOrxZhdYTrsWV1OtZy4MyG4JW7QGcexOyhfI8JFiY=w1052-h592-rw"
    ],
    "tags": [
      "Flutter",
      "Dart",
      "REST API",
      "UI/UX Design",
      "Online Payments",
      "GCM",
      "Code Review",
      "Scheduling",
      "Version Control",
      "BLoC",
      "Testing And Debugging"
    ],
    "link": "https://play.google.com/store/apps/details?id=com.drivingapp&hl=en_GB&gl=US",
    "link_ios": "https://apps.apple.com/gb/app/galadari-motor-driving-app/id1571248683",
    "highlighs": [
      "<b>App Design and Architecture:</b> Led the design and architectural planning of the GMDC app, utilizing Flutter to create a responsive and user-friendly interface.",
      "<b>Online Registration:</b> Developed the functionality for users to register online for driving license courses.",
      "<b>Course Discovery:</b> Implemented features for exploring different driving courses and offers available at GMDC.",
      "<b>Branch Locations:</b> Integrated location services to help users find GMDC branch locations.",
      "<b>Online Payments:</b> Enabled secure online fee payments through the app.",
      "<b>E-Learning Integration:</b> Implemented online lecture functionality for e-learning, allowing users to attend classes conveniently.",
      "<b>Class Scheduling:</b> Built features for booking and managing training classes, including tracking schedules and receiving reminders.",
      "<b>Test Appointment Booking:</b> Developed functionality for booking and tracking test appointments, including reminders for assessments.",
      "<b>Fee Tracking:</b> Created features for tracking fee details and overall progress in the driving license journey.",
      "<b>UI/UX Design:</b> Designed and implemented an intuitive user interface with Flutter, ensuring a seamless and engaging experience for users.",
      "<b>Testing and Quality Assurance:</b> Conducted rigorous testing to identify and resolve bugs, ensuring the app’s reliability and smooth performance across various devices.",
      "<b>Code Review and Maintenance:</b> Performed code reviews to maintain high code quality, and managed ongoing maintenance and updates for the app.",
      "<b>Version Control:</b> Used version control tools like Git to manage and track changes, facilitating collaborative development and project management.",
      "<b>Project Management:</b> Coordinated with team members to ensure timely delivery of features and adherence to project milestones."
    ]
  },
  {
    "id": 5,
    "title": "Pico-Bead Match Puzzle Game",
    "short_desc": "Pico-Bead Match Puzzle Game is an engaging and strategic alignment board game developed using Unity and C#. The game challenges players to strategically arrange beads in a diagonal pattern to form alignments, akin to classic board games like tic-tac-toe, Picaria, and Shisima. The objective is to create a three-in-a-row arrangement by moving pieces on the board, offering both single-player and multiplayer experiences.",
    "description": "Pico-Bead Match Puzzle Game is an engaging and strategic alignment board game developed using Unity and C#. The game challenges players to strategically arrange beads in a diagonal pattern to form alignments, akin to classic board games like tic-tac-toe, Picaria, and Shisima. The objective is to create a three-in-a-row arrangement by moving pieces on the board, offering both single-player and multiplayer experiences.<br><br>Developed with the Unity engine, the game features intuitive controls, smooth animations, and a visually appealing interface. The project involved collaboration with a co-developer, focusing on creating a compelling and enjoyable gaming experience through meticulous design and development",
    "image": "https://play-lh.googleusercontent.com/bjC2SFdc8RbbBcLwUpQMT50ycKres-lmbF_pTg5zdfwQgoHiBaqDG5av8jpzvDyrWQk=w1052-h592-rw",
    "images": [
      "https://play-lh.googleusercontent.com/XbJ4oapAiakteLbSBAJAiBwxbr5cA2zjGX_kFUlsD5NvP66znHA7MNQV5kqO_qWTs4w=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/_DKi4MeuKUcQYoHC3pNsejZkCyb657ap38eO1nNYYPUxGKxhqjHdb5kJEWwXTCCZBAg=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/VSE3SZEIITg5AvNHvpaNHxFZmF7N-93CT3Kxka7mEtKxup5op6NIgUdJTxe_vch8Sw=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/ZuPMXl6bOTWh8whgxlHV0EoarEyhOe4uHv38X9ESzurdgnEhyPG5G-vIZwsxVZxJsg=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/m0orqlTEedZlunru7jfo5xrYAPyuiwE1m6Vh7_KJrWTpfz2Pjl9yqDcDHGgjtdhG3Gp4=w1052-h592-rw"
    ],
    "tags": [
      "Unity",
      "C#",
      "Game Mechanics",
      "2D Game Development",
      "Animation",
      "User Interface (UI)",
      "Game Design",
      "Performance Optimization",
      "Collaborative Programming",
      "Game Testing"
    ],
    "link": "https://play.google.com/store/apps/details?id=com.savvygames.pico&hl=en_GB",
    "highlighs": [
      "<b>Game Design and Development:</b> Led the design and development of Pico-Bead Match Puzzle Game, utilizing Unity and C# to create a polished and interactive board game experience.",
      "<b>Coding and Implementation:</b> Developed core game mechanics and features using C# in Unity, including piece movement, alignment detection, and game logic. Implemented gameplay features to ensure a smooth and engaging user experience.",
      "<b>Collaborative Development:</b> Worked closely with a co-developer through pair programming and regular collaboration sessions. Shared responsibilities in coding, problem-solving, and feature implementation, ensuring a cohesive and high-quality game.",
      "<b>User Interface Design:</b> Designed and implemented an intuitive and user-friendly interface within Unity, focusing on ease of use and visual appeal to enhance player engagement.",
      "<b>Animation and Visuals:</b> Created and integrated animations for piece movement and game interactions, contributing to a dynamic and visually attractive game environment.",
      "<b>Testing and Debugging:</b> Conducted extensive testing to identify and fix bugs, ensuring the game runs smoothly across different devices and scenarios. Implemented debugging techniques to address and resolve performance issues.",
      "<b>Performance Optimization:</b> Optimized game performance to ensure smooth gameplay, including efficient resource management and responsive controls.",
      "<b>Version Control and Documentation:</b> Utilized version control systems like Git for managing source code and maintaining project history. Created comprehensive documentation for the game's development process and features.",
      "<b>Project Management:</b> Coordinated project milestones and deadlines, ensuring timely delivery of game features and adherence to development schedules."
    ]
  },
  {
    "id": 6,
    "title": "Words Wagon Game",
    "short_desc": "Words Wagon is an engaging and stimulating word game designed to challenge and entertain players while enhancing their vocabulary skills. Developed using Unity and C#, Word Wagon invites players to connect letters, form words, and achieve high word streaks. This game provides an enjoyable and educational experience, making learning new words both fun and addictive.",
    "description": "Words Wagon is an engaging and stimulating word game designed to challenge and entertain players while enhancing their vocabulary skills. Developed using Unity and C#, Word Wagon invites players to connect letters, form words, and achieve high word streaks. This game provides an enjoyable and educational experience, making learning new words both fun and addictive.<br><br>Players can embark on a journey of word discovery, sharpening their language skills through increasingly complex puzzles. With its intuitive gameplay and vibrant visuals, Word Wagon is ideal for players who enjoy word puzzles and want to keep their minds active and engaged.",
    "image": "https://play-lh.googleusercontent.com/cEnke4pBE4HosNJ3lxdVQo2yZ20BMvBk0N_wp9-Wpp9rIPooYHxSBS4oXmmKyeF8Nlk=w1052-h592-rw",
    "images": [
      "https://play-lh.googleusercontent.com/JATl56ujxAAt_DyFdafi0--SUn8YdX3g-YW_-JeLUDYcGH7YY8p5Bh8Vr6pkP4ts5w=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/Bjh38FXBkrpKL4VGEqxdseS6UVNKjmZfhaGI4gRM4PnUxrp8s5_3jqf7YaQUVvF9nw=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/asR1gOfEUaXywtXfUD-PFrMe57vgUq9vTBp-pf444TFPlbK9Dcx5oEzxg_qRCiXNXMty=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/4O9QrTiFmgli7TcSPysJGGgBg_LS8edPoHaEG0C_7hZvXf6noEVzXDJe7KceUNgsTr8=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/nxee6pqvsTok85y00T46GBfAkWDxdVUx2L3L_-FuDCIHK2ebZnKSVC4cOfdlsHBX6lk=w1052-h592-rw"
    ],
    "tags": [
      "Unity",
      "C#",
      "Word Puzzle Mechanics",
      "2D Game Development",
      "Animation",
      "User Interface (UI)",
      "Game Design",
      "Performance Optimization",
      "Collaborative Programming",
      "Educational Game",
      "Game Debugging"
    ],
    "link": "https://play.google.com/store/apps/details?id=com.loopi.wordswagon&hl=en_GB&gl=US",
    "highlighs": [
      "<b>Game Design and Development:</b> Led the design and development of Word Wagon using Unity and C#, focusing on creating an engaging word puzzle experience with intuitive gameplay mechanics.",
      "<b>Word Puzzle Mechanics:</b> Implemented core gameplay features, including letter connection, word formation, and streak tracking, ensuring a challenging and rewarding player experience.",
      "<b>User Interface (UI) Design:</b> Designed and developed a user-friendly interface, including menus, game boards, and feedback systems, to enhance the overall player experience.",
      "<b>Animation and Visuals:</b> Created and integrated animations and visual effects to make gameplay visually appealing and interactive. Implemented animations for letter movements and word formations.",
      "<b>Performance Optimization:</b> Optimized game performance to ensure smooth gameplay, including efficient resource management and responsive interactions.",
      "<b>Testing and Debugging:</b> Conducted thorough testing to identify and resolve bugs, ensuring the game functions correctly and provides a seamless experience across various devices.",
      "<b>Version Control:</b> Utilized version control systems like Git to manage and track changes in the codebase, facilitating collaboration and maintaining project history.",
      "<b>Collaborative Development:</b> Worked closely with a co-developer, sharing tasks and collaborating on feature implementation, problem-solving, and overall game development.",
      "<b>Game Balancing:</b> Designed and adjusted difficulty levels and game progression to provide a balanced challenge and maintain player engagement.",
      "<b>Educational Value:</b> Focused on creating an educational yet entertaining game that helps players learn new words and improve their vocabulary skills."
    ]
  }
]
