[
  {
    "id": 1,
    "title": "MyDyson™",
    "short_desc": "As a mobile app developer, I contributed to the development and enhancement of the MyDyson™ app, a comprehensive tool designed to elevate the user experience for Dyson machine owners.",
    "description": "As a mobile app developer, I contributed to the development and enhancement of the MyDyson™ app, a comprehensive tool designed to elevate the user experience for Dyson machine owners. This project involved re-engineering the app to include tailored content and features for hair care machines and cordless vacuums, along with providing real-time air quality information and remote control capabilities for Dyson purifiers and humidifiers. My role focused on writing scalable, clean, and stable code, collaborating with cross-functional teams, and designing elegant UI components using Compose UI. Additionally, I worked on core connectivity features, enabling seamless management of multiple devices and facilitating user engagement through community integration.",
    "image": "https://play-lh.googleusercontent.com/L6sS1R-ea5F2HLIB8WlqvPuGG1Z8M9g-M5Ss36pDZdVQAXcoh6ODtqSURBzjbECGWdg",
    "images": [
      "https://play-lh.googleusercontent.com/CHt4OWe8UvO0Qau4j9Tq5ztaX2-soZBs4oD6OQY8Q_RBQOFM516NYtLbqE6rO7RtwA=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/r4Q9zi9RhFY233FBDpZjAE6yUN_b8iMJ7kpdjR3dBN9srcWD6R1oMPBCNnl7pSn-KuOv=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/pdLAQq0sGWDJJom5VEk1yWcbPgWbz4MCUWkkONDCWjEimscnGRMOOJDAPH1Ztt429z8=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/UAEzyITJoLjwH0Z6EIoBb2l5LhHURY8zvBuVnUzrU9QyxheUxHuHHYMw8uDeylIHQg=w1052-h592-rw"
    ],
    "highlighs": [
      "Implemented new features in MyDyson app using Kotlin, Jetpack compose, Android Navigation Component based on modern Android development tools and principles like MVVM, Kotlin-coroutine, Flow, RxJava, Dagger/Hilt/Koin, Retrofit and Room",
      "Enhanced user satisfaction to 95% by fixing connectivity issues in Dyson connected products by optimizing Bluetooth Low Energy (BLE) connections and introducing a backoff retransmission mechanism.",
      "Innovated paparazzi snapshot wrapper for comprehensive testing of Jetpack Compose UI elements covering all UI/UX states saving substantial development time, ensuring no missed test cases, and achieving 100% test coverage",
      "Introduced an engineering UI to troubleshoot Dyson-connected product issues faced by the QA/stakeholders, enabling cross-team developers to quickly identify and assign bugs to the relevant teams",
      "Reduced Java source base to 2% in a multi-module project by re-writing Java code to Kotlin during my innovative time.",
      "Authored reusable, self-documenting, high-performing code and participated in code reviews and pair programming to ensure 100% code quality and maintainability",
      "Assisted QA to setup, build and test frameworks such as Junit, Espresso, and Paparazzi",
      "Collaborated with cross-functional teams (UI/UX team, Embedded, Cloud, and QA) across multiple geographies to define, design, and ship new features",
      "Experienced in Agile environment and presented sprint demos and technical sessions to stakeholders in community meetings."
    ],
    "tags": [
      "Kotlin",
      "Android",
      "Compose",
      "MVVM",
      "Clean Code",
      "Dagger2",
      "Analytics",
      "CI/CD",
      "BLE",
      "MQTT",
      "Multi-module"
    ],
    "link": "https://play.google.com/store/apps/details?id=com.dyson.mobile.android&hl=en_GB"
  },
  {
    "id": 2,
    "title": "Lumos Controls",
    "short_desc": "As an initial team member of the Lumos Control startup project, I played a pivotal role in its development and evolution. The project began with Java and later transitioned to Kotlin",
    "description": "As an initial team member of the Lumos Control startup project, I played a pivotal role in its development and evolution. The project began with Java and later transitioned to Kotlin, employing MVP and MVVM architectures. I was instrumental in building and leading the team, conducting interviews, providing mentorship, and driving technical innovation. Key contributions included integrating advanced tech features such as BLE, MQTT, WiFi, TCP/IP protocols, and HTTP/REST API calls. I also developed a standalone smart home IoT SDK, enabling the company to rebrand the app for multiple clients, including Samsung, Jio, and Philips.",
    "image": "https://i.ytimg.com/vi/hxt6UeHBp3U/hqdefault.jpg",
    "tags": [
      "Kotlin",
      "Android",
      "Java",
      "IoT",
      "Xml",
      "Room",
      "BLE",
      "MQTT",
      "Retrofit",
      "Hilt",
      "MVVM"
    ],
    "images": [
      "https://play-lh.googleusercontent.com/hLHwBCBJ15PyeCZlZETiVgN8mno6lhtBdl_uOd5pcNzA_AWTvEn3hNcsRYrrnMCg=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/osGBZMqHJTvfMN8LfADboJNpdqhWEaGaEkZIFhjbheRWQo93xGZgxuHYhYhmbNcbrg=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/oaQoyEOQ3d1Bo2FxLwKOmzRh1pnYrAyAcL1yBP4-9p8m5Mg8J4PLvef86zQlMtv7SdU=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/o2XaWTON-87H-XlYc015jAYL4eZjLlNjZnqCl2mWr3kMHCZ4-1EbehvCNsg7PhqdSrc=w1052-h592-rw",
      "https://play-lh.googleusercontent.com/gCHCcwysg8_5ybjCNjGzUO5gmzgusc6zQYvam15Pyezqy0ckNN3SksdDA3YqPV_fTg=w1052-h592-rw"
    ],
    "highlighs": [
      "As a proven leader and application architect, I drive system architecture decisions and lead projects from concept through to launch",
      "Prototyped, designed, developed, tested and published mobile apps for Home automation, Real-time tracking and Broadcasting and media solutions",
      "Delivered quarantine management apps within stringent timelines (under 45 days) to Ministry of Health of various countries (Singapore, Brunei, Cayman Island) during the COVID pandemic resulting in 50% revenue increase",
      "Developed WiSilica Mesh Android SDK with documentation, empowering smart home/indoor tracking vendors to develop their own custom apps which contributed to acquiring notable clients like Samsung, Philips, iGuzzini and Jio",
      "Managed Android OS API updates successfully in run-time permissions, notification, background service restriction and location access, ensuring smooth operation of a user-sensitive quarantine management system",
      "Built offline-first app for optimum server API usage, reducing server traffic by 30%",
      "Resolved Bluetooth Low Energy (BLE) issues in IoT based applications, ensuring continued support on 100% Android versions and phones by: <br><td>-- Developing a BLE scanner wrapper to resolve inherent BLE scan limitations from Android 8.0 <br><td>-- Using BLE central mode of communication for phones which do not support BLE peripheral mode",
      "Migrated muti-module project from Java to Kotlin and MVVM architecture which reduced crashes to below 5% and resolved issues in application state management",
      "Developed Android Studio plugin to switch between application variant which reduced the build time by 40%",
      "Innovated an encryption library using AES-128 for secure communication, protecting against various security threats such as man-in-the-middle attack, attribute spoofing and eavesdropping",
      "Integrated Google Play services, Firebase analytics and Google Map API to boost user tracking by 30%",
      "Developed an internal sniffer app to decode the BLE messages from the embedded devices aiding cross-functional team and customers to analyze nearby BLE traffic and detect message loss resulting in BLE communication failure",
      "Hired and mentored junior developers, facilitating rapid project onboarding and skill development while transparently communicating to management about their progress and team building activities",
      "Promoted development best practices, patterns and standards"
    ],
    "link": "https://play.google.com/store/apps/details?id=com.wisilica.Home&hl=en_GB"
  }
]
